app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @article = Article.find(id)

INSERT INTO "articles" ("title", "content", "stars", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Daredevil"], ["content", "Waouh"], ["stars", 5], ["created_at", "2018-05-16 13:48:33.841510"], ["updated_at", "2018-05-16 13:48:33.841510"]]
---
  def create
    @article = Article.create(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Kratos"], ["content", "Dieu de la guerre"], ["updated_at", "2018-05-18 10:06:19.660451"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)